Revit API Introduction Labs
LabUtils.GetElementsOfType Method
 Return all elements of the requested class in the active document matching the given built-in category.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public static FilteredElementCollector GetElementsOfType(
	Document doc,
	Type type,
	BuiltInCategory bic
)
Visual Basic (Declaration)
Public Shared Function GetElementsOfType ( _
	doc As Document, _
	type As Type, _
	bic As BuiltInCategory _
) As FilteredElementCollector
Visual C++
public:
static FilteredElementCollector^ GetElementsOfType(
	Document^ doc,
	Type^ type,
	BuiltInCategory bic
)
Parameters
doc
Type: Document
type
Type: System.Type
bic
Type: BuiltInCategory
See Also
LabUtils Class
Labs Namespace